{"author_name": "ThoughtLawyer", "award_count": 0, "body": "Most people don't argue heaven after death, assuming they believe in anything after death, but many are less willing to accept hell, and in particular that it would be eternal, or unending. What follows are passages which I believe are relevant to the subject, and would help illuminate what hell is. \r\n\r\nGiven that the most controversial component is whether the punishment be eternal, I am going to add emphasis to certain portions which address that specifically.\r\n\r\nI have not kept back verses, so if you think there are other verses in scripture which say something other than what is being said here, please comment with them. When writing these posts I usually gather from two sources, one being my own notes, and another being openbible.info, which I find to be a good crowd sourced compilation of verses pertaining to various doctrines/topics. \r\n\r\nI will give more detail on my personal stance on the matter at the end. **Please, as you read through this, read through the passages in your own bible.** I often leave out verses to keep the post shorter. (I try to use '...' to indicate when I am skipping verses, in addition to the comma separated list at the beginning of each quote). It is also a good opportunity to identify any differences in doctrine between one bible version and another. Everything here is KJV.\r\n_________________________________________________________________________________________________________\r\n\r\nThe matter is concisely summarized here by an angel of God speaking to Daniel:\r\n\r\n>Daniel 12:2 - And many of them that sleep in the dust of the earth shall awake, some to everlasting life, and some to shame and **everlasting contempt.**\r\n\r\n**Everlasting** is a word that is used fairly often with respect to hell; both in the old and new testament. Can you imagine how terrible a translation would have to be to mess this up? I accept that it is technically possible for the translations we have available to us to be corrupted, but until *that* can be shown, then must we not accept what the text says? lets see what else it says...\r\n\r\n>John 5:28-29 - (28) Marvel not at this: for the hour is coming, in the which all that are in the graves shall hear his voice, (29) and shall come forth; **they that have done good, unto the resurrection of life; and they that have done evil, unto the resurrection of damnation.**\r\n\r\nThe above is documented as having been the words of Jesus himself.\r\n\r\n>Matthew 10:28, 32-33 - (28) And fear not them which kill the body, but are not able to kill the soul: but rather fear him which is able to **destroy both soul and body in hell**. ... (32) Whosoever therefore shall confess me before men, him will I confess also before my Father which is in heaven. (33)  But whosoever shall deny me before men, him will I also deny before my Father which is in heaven. \r\n\r\nSome people use the above passage to justify the idea that hell is not eternal, since the soul is destroyed, and it uses the word destruction elsewhere as well, so this is not an isolated instance.\r\n\r\n>Matthew 13:49-50 -  (49) So shall it be at the end of the world: the angels shall come forth, and sever the wicked from among the just, (50)  **and shall cast them into the furnace of fire**: there shall be wailing and gnashing of teeth. \r\n\r\n>Matthew 25:41,44-46 - (41) Then shall he say also unto them on the left hand, Depart from me, ye cursed, into **everlasting fire**, prepared for the devil and his angels: ... (44) Then shall they also answer him, saying, Lord, when saw we thee an hungred, or athirst, or a stranger, or naked, or sick, or in prison, and did not minister unto thee? (45) Then shall he answer them, saying, Verily I say unto you, Inasmuch as ye did it not to one of the least of these, ye did it not to me. (46) And these shall go away into **everlasting punishment**: but the righteous into life eternal.\r\n\r\n>Mark 9:43-44 - (43) And if thy hand offend thee, cut it off: it is better for thee to enter into life maimed, than having two hands to go into hell, **into the fire that never shall be quenched**: (44) **Where their worm dieth not, and the fire is not quenched.**\r\n\r\n>John 3:18,36 - (18) He that believeth on him is not condemned: but **he that believeth not is condemned already**, because he hath not believed in the name of the only begotten Son of God. ... (36) He that believeth on the Son hath everlasting life: and **he that believeth not the Son shall not see life; but the wrath of God abideth on him**.\r\n\r\nHere the choices are everlasting life, or the wrath of God. Is this substantially more palpable than everlasting life and everlasting torment?\r\n\r\n>2 Thessalonians 1:8-9 - (8)  In flaming fire taking vengeance on them that know not God, and that obey not the gospel of our Lord Jesus Christ: (9)  Who shall be punished with **everlasting destruction from the presence of the Lord, and from the glory of his power;**\r\n\r\nNow, if we imagine earth as a place where both good and evil exists, where evil abounds, but where God still mitigates and protects, and then we shift to considering a world where God plays no part at all, what would that world look like? If the punishment of the wicked ultimately amounts to complete separation from God, what could be worse than that? what could be more torturous? If it is the distance to which we find ourselves separated from God which determines our level of torment, (in both this world and the next) then what would absolute separation result in?\r\n\r\n>Jude 1:7 - Even as Sodom and Gomorrha, and the cities about them in like manner, giving themselves over to fornication, and going after strange flesh, are set forth for an example, suffering the vengeance of **eternal fire.**\r\n\r\n>Revelation 14:11 - **And the smoke of their torment ascendeth up for ever and ever**: and they have no rest day nor night, who worship the beast and his image, and whosoever receiveth the mark of his name. \r\n\r\n>Revelation 20:10,15 - (10) And the devil that deceived them was cast into the lake of fire and brimstone, where the beast and the false prophet are, and **shall be tormented day and night for ever and ever.** (15) And whosoever was not found written in the book of life was cast into the lake of fire. \r\n\r\n>Revelation 21:7-8 - (7)  He that overcometh shall inherit all things; and I will be his God, and he shall be my son. (8)  **But the fearful, and unbelieving, and the abominable, and murderers, and whoremongers, and sorcerers, and idolaters, and all liars, shall have their part in the lake which burneth with fire and brimstone**: which is the second death.\r\n\r\n_________________________________________________________________________________________________________\r\n\r\nSo now my thoughts; one thought is that even though the wicked may all go to the same place, the punishment they receive is still described as being commensurate with their crime:\r\n\r\n>Luke 12:46-48 - (46) The lord of that servant will come in a day when he looketh not for him, and at an hour when he is not aware, and will cut him in sunder, and will appoint him his portion with the unbelievers. (47) And that servant, which knew his lord's will, and prepared not himself, neither did according to his will, shall be beaten with many stripes. (48) But he that knew not, and did commit things worthy of stripes, shall be beaten with few stripes. For unto whomsoever much is given, of him shall be much required: and to whom men have committed much, of him they will ask the more. \r\n\r\n>Matthew 10:14-15 - (14) And whosoever shall not receive you, nor hear your words, when ye depart out of that house or city, shake off the dust of your feet. (15) Verily I say unto you, It shall be more tolerable for the land of Sodom and Gomorrha in the day of judgment, than for that city.\r\n\r\nSo maybe the homeless drunkard will have to endure 100°F, but those who are more Hitler-like will have to endure 125°F, and the anti-christ and Satan will have to endure 150°F. This is likely an over-simplification of the matter, but it is not hard to imagine that God's judgment is fair, and such fairness is indicated in numerous places in scripture.\r\n\r\nAs for the eternal part, I think it is worth considering that there will not be time, and I think this is what is being referenced when eternity is spoken of; and if there is no time, then wouldn't *any* time be *all* time? As in, if there is no time, how can there be a distinction made in the severity of the punishment as it relates to the length of how long one endures such punishment? What would make more sense, is that if the severity was determined not by the length of the punishment, but by the punishment itself. If you are sentenced to life in prison with a beating once per month, it probably wouldn't be such a bad experience overall. If the beating were once per week, it would be much worse, and if the beating were every day, it would be nigh intolerable.\r\n\r\nIn summary, having said all of that, it may be that the bible versions we have available to us are corrupted (there were times in the history of both Israel and the Roman Catholic church wherein access to God's word was restricted to the masses), and thus punishment may not be eternal but rather limited in duration, (after which the soul is destroyed and the individual ceases to experience anything); \r\n\r\n*however*, as the text reads, there's really no way around what is at least the potential for eternal punishment, except that maybe certain sorts of people are destroyed, and other more severe sinners are not destroyed, but rather tormented forever. I have serious reservations about this, but I don't rule anything out, given how limited my understanding is.", "body_html": "<p>Most people don't argue heaven after death, assuming they believe in anything after death, but many are less willing to accept hell, and in particular that it would be eternal, or unending. What follows are passages which I believe are relevant to the subject, and would help illuminate what hell is.</p>\n<p>Given that the most controversial component is whether the punishment be eternal, I am going to add emphasis to certain portions which address that specifically.</p>\n<p>I have not kept back verses, so if you think there are other verses in scripture which say something other than what is being said here, please comment with them. When writing these posts I usually gather from two sources, one being my own notes, and another being <a href=\"https://openbible.info\" rel=\"nofollow noopener\" target=\"_blank\">openbible.info</a>, which I find to be a good crowd sourced compilation of verses pertaining to various doctrines/topics.</p>\n<p>I will give more detail on my personal stance on the matter at the end. <strong>Please, as you read through this, read through the passages in your own bible.</strong> I often leave out verses to keep the post shorter. (I try to use '...' to indicate when I am skipping verses, in addition to the comma separated list at the beginning of each quote). It is also a good opportunity to identify any differences in doctrine between one bible version and another. Everything here is KJV.</p>\n<hr/>\n<p>The matter is concisely summarized here by an angel of God speaking to Daniel:</p>\n<blockquote>\n<p>Daniel 12:2 - And many of them that sleep in the dust of the earth shall awake, some to everlasting life, and some to shame and <strong>everlasting contempt.</strong></p>\n</blockquote>\n<p><strong>Everlasting</strong> is a word that is used fairly often with respect to hell; both in the old and new testament. Can you imagine how terrible a translation would have to be to mess this up? I accept that it is technically possible for the translations we have available to us to be corrupted, but until <em>that</em> can be shown, then must we not accept what the text says? lets see what else it says...</p>\n<blockquote>\n<p>John 5:28-29 - (28) Marvel not at this: for the hour is coming, in the which all that are in the graves shall hear his voice, (29) and shall come forth; <strong>they that have done good, unto the resurrection of life; and they that have done evil, unto the resurrection of damnation.</strong></p>\n</blockquote>\n<p>The above is documented as having been the words of Jesus himself.</p>\n<blockquote>\n<p>Matthew 10:28, 32-33 - (28) And fear not them which kill the body, but are not able to kill the soul: but rather fear him which is able to <strong>destroy both soul and body in hell</strong>. ... (32) Whosoever therefore shall confess me before men, him will I confess also before my Father which is in heaven. (33)  But whosoever shall deny me before men, him will I also deny before my Father which is in heaven.</p>\n</blockquote>\n<p>Some people use the above passage to justify the idea that hell is not eternal, since the soul is destroyed, and it uses the word destruction elsewhere as well, so this is not an isolated instance.</p>\n<blockquote>\n<p>Matthew 13:49-50 -  (49) So shall it be at the end of the world: the angels shall come forth, and sever the wicked from among the just, (50)  <strong>and shall cast them into the furnace of fire</strong>: there shall be wailing and gnashing of teeth.</p>\n</blockquote>\n<blockquote>\n<p>Matthew 25:41,44-46 - (41) Then shall he say also unto them on the left hand, Depart from me, ye cursed, into <strong>everlasting fire</strong>, prepared for the devil and his angels: ... (44) Then shall they also answer him, saying, Lord, when saw we thee an hungred, or athirst, or a stranger, or naked, or sick, or in prison, and did not minister unto thee? (45) Then shall he answer them, saying, Verily I say unto you, Inasmuch as ye did it not to one of the least of these, ye did it not to me. (46) And these shall go away into <strong>everlasting punishment</strong>: but the righteous into life eternal.</p>\n</blockquote>\n<blockquote>\n<p>Mark 9:43-44 - (43) And if thy hand offend thee, cut it off: it is better for thee to enter into life maimed, than having two hands to go into hell, <strong>into the fire that never shall be quenched</strong>: (44) <strong>Where their worm dieth not, and the fire is not quenched.</strong></p>\n</blockquote>\n<blockquote>\n<p>John 3:18,36 - (18) He that believeth on him is not condemned: but <strong>he that believeth not is condemned already</strong>, because he hath not believed in the name of the only begotten Son of God. ... (36) He that believeth on the Son hath everlasting life: and <strong>he that believeth not the Son shall not see life; but the wrath of God abideth on him</strong>.</p>\n</blockquote>\n<p>Here the choices are everlasting life, or the wrath of God. Is this substantially more palpable than everlasting life and everlasting torment?</p>\n<blockquote>\n<p>2 Thessalonians 1:8-9 - (8)  In flaming fire taking vengeance on them that know not God, and that obey not the gospel of our Lord Jesus Christ: (9)  Who shall be punished with <strong>everlasting destruction from the presence of the Lord, and from the glory of his power;</strong></p>\n</blockquote>\n<p>Now, if we imagine earth as a place where both good and evil exists, where evil abounds, but where God still mitigates and protects, and then we shift to considering a world where God plays no part at all, what would that world look like? If the punishment of the wicked ultimately amounts to complete separation from God, what could be worse than that? what could be more torturous? If it is the distance to which we find ourselves separated from God which determines our level of torment, (in both this world and the next) then what would absolute separation result in?</p>\n<blockquote>\n<p>Jude 1:7 - Even as Sodom and Gomorrha, and the cities about them in like manner, giving themselves over to fornication, and going after strange flesh, are set forth for an example, suffering the vengeance of <strong>eternal fire.</strong></p>\n</blockquote>\n<blockquote>\n<p>Revelation 14:11 - <strong>And the smoke of their torment ascendeth up for ever and ever</strong>: and they have no rest day nor night, who worship the beast and his image, and whosoever receiveth the mark of his name.</p>\n</blockquote>\n<blockquote>\n<p>Revelation 20:10,15 - (10) And the devil that deceived them was cast into the lake of fire and brimstone, where the beast and the false prophet are, and <strong>shall be tormented day and night for ever and ever.</strong> (15) And whosoever was not found written in the book of life was cast into the lake of fire.</p>\n</blockquote>\n<blockquote>\n<p>Revelation 21:7-8 - (7)  He that overcometh shall inherit all things; and I will be his God, and he shall be my son. (8)  <strong>But the fearful, and unbelieving, and the abominable, and murderers, and whoremongers, and sorcerers, and idolaters, and all liars, shall have their part in the lake which burneth with fire and brimstone</strong>: which is the second death.</p>\n</blockquote>\n<hr/>\n<p>So now my thoughts; one thought is that even though the wicked may all go to the same place, the punishment they receive is still described as being commensurate with their crime:</p>\n<blockquote>\n<p>Luke 12:46-48 - (46) The lord of that servant will come in a day when he looketh not for him, and at an hour when he is not aware, and will cut him in sunder, and will appoint him his portion with the unbelievers. (47) And that servant, which knew his lord's will, and prepared not himself, neither did according to his will, shall be beaten with many stripes. (48) But he that knew not, and did commit things worthy of stripes, shall be beaten with few stripes. For unto whomsoever much is given, of him shall be much required: and to whom men have committed much, of him they will ask the more.</p>\n</blockquote>\n<blockquote>\n<p>Matthew 10:14-15 - (14) And whosoever shall not receive you, nor hear your words, when ye depart out of that house or city, shake off the dust of your feet. (15) Verily I say unto you, It shall be more tolerable for the land of Sodom and Gomorrha in the day of judgment, than for that city.</p>\n</blockquote>\n<p>So maybe the homeless drunkard will have to endure 100°F, but those who are more Hitler-like will have to endure 125°F, and the anti-christ and Satan will have to endure 150°F. This is likely an over-simplification of the matter, but it is not hard to imagine that God's judgment is fair, and such fairness is indicated in numerous places in scripture.</p>\n<p>As for the eternal part, I think it is worth considering that there will not be time, and I think this is what is being referenced when eternity is spoken of; and if there is no time, then wouldn't <em>any</em> time be <em>all</em> time? As in, if there is no time, how can there be a distinction made in the severity of the punishment as it relates to the length of how long one endures such punishment? What would make more sense, is that if the severity was determined not by the length of the punishment, but by the punishment itself. If you are sentenced to life in prison with a beating once per month, it probably wouldn't be such a bad experience overall. If the beating were once per week, it would be much worse, and if the beating were every day, it would be nigh intolerable.</p>\n<p>In summary, having said all of that, it may be that the bible versions we have available to us are corrupted (there were times in the history of both Israel and the Roman Catholic church wherein access to God's word was restricted to the masses), and thus punishment may not be eternal but rather limited in duration, (after which the soul is destroyed and the individual ceases to experience anything);</p>\n<p><em>however</em>, as the text reads, there's really no way around what is at least the potential for eternal punishment, except that maybe certain sorts of people are destroyed, and other more severe sinners are not destroyed, but rather tormented forever. I have serious reservations about this, but I don't rule anything out, given how limited my understanding is.</p>\n", "comment_count": 1, "created_utc": 1606423585, "domain": "text post", "downvotes": 0, "edited_utc": 0, "fullname": "t2_57t2", "guild_id": "2mo", "guild_name": "JesusChrist", "herald_guild": null, "id": "57t2", "is_archived": true, "is_banned": false, "is_bot": false, "is_crosspost": false, "is_deleted": false, "is_distinguished": false, "is_heralded": false, "is_nsfl": false, "is_nsfw": false, "is_offensive": false, "is_pinned": false, "meta_description": null, "meta_title": null, "original_guild_id": null, "original_guild_name": null, "permalink": "/+JesusChrist/post/57t2/hell-sheol-hades-tartarus", "score": 3, "thumb_url": null, "title": "Hell (Sheol, Hades, Tartarus)", "upvotes": 4, "url": ""}
{"author": {"banner_url": "/assets/images/profiles/default_bg.png", "bio": "Goodbye. https://ruqqus.com/+The_Cabal/post/d9y9/i-told-you-so-all-the\r\n\r\nRemember: History repeats, and the unaware are doomed to repeat it.", "bio_html": "<p>Goodbye. <a href=\"https://ruqqus.com/+The_Cabal/post/d9y9/i-told-you-so-all-the\" target=\"_blank\">https://ruqqus.com/+The_Cabal/post/d9y9/i-told-you-so-all-the</a></p>\n<p>Remember: History repeats, and the unaware are doomed to repeat it.</p>\n", "created_utc": 1590615852, "id": "3eb", "is_banned": 0, "is_premium": false, "is_private": true, "permalink": "/@CrystalVulpine", "profile_url": "https://api.ruqqus.com/assets/images/profiles/default-profile-pic.png", "title": null, "username": "CrystalVulpine"}, "author_name": "CrystalVulpine", "award_count": 0, "body": "The resources we have available to us today on this matter are sparse. There's really no way to know for sure, most references to both everlasting punishment and annihilation are in either parables or symbolic writings. Some also describe fire and others a dark place of weeping, or being imprisoned. To make things even more confusing, there's also the second lake of fire that death and the original hell are thrown into. Not that it really matters, since either way you definitely don't want to end up with it.\r\n\r\nHowever, for those interested there's a very old apocryphal document called the Revelation of Peter that describes life after death. In hell, it is not said to be a pit of literal fire, rather people must suffer the torment they caused people during their lives. This book was accepted in some early churches and rejected in others. There's also a section that claims they will all eventually be saved because of the prayers of the righteous, the latter part of which is a huge red flag to me that something's not right because it's the same concept as purgatory and buying your way into heaven. So I doubt it's legit myself, but in any case it still sheds light on an earlier concept of hell than what we have now.\r\n\r\nWe really can't be sure. A lot of the \"fire\" references are an allusion to either destruction or mass graves where bodies were endlessly cremated in those times, but there's also the story of the rich man who was in flames, and it's hard to tell which ones are literal vs symbolic. And everlasting punishment, including both the Revelation of Peter type ones and burning in a lake of fire, is quite similar to ancient pagan myths of the underworld, even referring to the place as *Hades* in most instances, so it might be allegorical. But again, it could also be that those pagan myths derived from the original jewish sources like how the flood did.\r\n\r\nIn any case, it's bad news.", "body_html": "<p>The resources we have available to us today on this matter are sparse. There's really no way to know for sure, most references to both everlasting punishment and annihilation are in either parables or symbolic writings. Some also describe fire and others a dark place of weeping, or being imprisoned. To make things even more confusing, there's also the second lake of fire that death and the original hell are thrown into. Not that it really matters, since either way you definitely don't want to end up with it.</p>\n<p>However, for those interested there's a very old apocryphal document called the Revelation of Peter that describes life after death. In hell, it is not said to be a pit of literal fire, rather people must suffer the torment they caused people during their lives. This book was accepted in some early churches and rejected in others. There's also a section that claims they will all eventually be saved because of the prayers of the righteous, the latter part of which is a huge red flag to me that something's not right because it's the same concept as purgatory and buying your way into heaven. So I doubt it's legit myself, but in any case it still sheds light on an earlier concept of hell than what we have now.</p>\n<p>We really can't be sure. A lot of the \"fire\" references are an allusion to either destruction or mass graves where bodies were endlessly cremated in those times, but there's also the story of the rich man who was in flames, and it's hard to tell which ones are literal vs symbolic. And everlasting punishment, including both the Revelation of Peter type ones and burning in a lake of fire, is quite similar to ancient pagan myths of the underworld, even referring to the place as <em>Hades</em> in most instances, so it might be allegorical. But again, it could also be that those pagan myths derived from the original jewish sources like how the flood did.</p>\n<p>In any case, it's bad news.</p>\n", "created_utc": 1606626635, "downvotes": 0, "edited_utc": 1606626751, "fullname": "t3_i9pq", "guild": {"banner_url": "https://i.ruqqus.com/board/jesuschrist/banner-3.png", "color": "#2A96F3", "created_utc": 1596060787, "description": "This guild is to serve as a communication medium for fellow believers. The bible is the ultimate source of authority for any and all doctrine or doctrinal disputes. Posts can be made questioning the validity/veracity of the bible itself, but in any conversation wherein the topic itself is not the legitimacy of the bible, then it is assumed to be correct and factual. How else can any foundation be established except if the bible is a source of truth? Is man's opinion above God's word?\n\nTo the greatest extent possible i will avoid all forms of censorship, even spam would ideally be dealt with by down-voting rather than deleting. There is no restriction on post-type (you can post whatever you want) aside from the obvious nono's like porn, spam, calls to violence, etc..", "description_html": "<p>This guild is to serve as a communication medium for fellow believers. The bible is the ultimate source of authority for any and all doctrine or doctrinal disputes. Posts can be made questioning the validity/veracity of the bible itself, but in any conversation wherein the topic itself is not the legitimacy of the bible, then it is assumed to be correct and factual. How else can any foundation be established except if the bible is a source of truth? Is man's opinion above God's word?</p>\n<p>To the greatest extent possible i will avoid all forms of censorship, even spam would ideally be dealt with by down-voting rather than deleting. There is no restriction on post-type (you can post whatever you want) aside from the obvious nono's like porn, spam, calls to violence, etc..</p>\n", "disallowbots": false, "fullname": "t4_2mo", "id": "2mo", "is_banned": false, "is_private": false, "is_restricted": false, "is_siege_protected": false, "name": "JesusChrist", "over_18": false, "permalink": "/+JesusChrist", "profile_url": "/assets/images/guilds/default-guild-icon.png"}, "guild_id": "2mo", "herald_guild": null, "id": "i9pq", "is_archived": true, "is_banned": false, "is_bot": false, "is_deleted": false, "is_distinguished": false, "is_heralded": false, "is_nsfl": false, "is_nsfw": false, "is_offensive": false, "level": 1, "permalink": "/+JesusChrist/post/57t2/hell-sheol-hades-tartarus/i9pq", "post": {"author_name": "ThoughtLawyer", "award_count": 0, "body": "Most people don't argue heaven after death, assuming they believe in anything after death, but many are less willing to accept hell, and in particular that it would be eternal, or unending. What follows are passages which I believe are relevant to the subject, and would help illuminate what hell is. \r\n\r\nGiven that the most controversial component is whether the punishment be eternal, I am going to add emphasis to certain portions which address that specifically.\r\n\r\nI have not kept back verses, so if you think there are other verses in scripture which say something other than what is being said here, please comment with them. When writing these posts I usually gather from two sources, one being my own notes, and another being openbible.info, which I find to be a good crowd sourced compilation of verses pertaining to various doctrines/topics. \r\n\r\nI will give more detail on my personal stance on the matter at the end. **Please, as you read through this, read through the passages in your own bible.** I often leave out verses to keep the post shorter. (I try to use '...' to indicate when I am skipping verses, in addition to the comma separated list at the beginning of each quote). It is also a good opportunity to identify any differences in doctrine between one bible version and another. Everything here is KJV.\r\n_________________________________________________________________________________________________________\r\n\r\nThe matter is concisely summarized here by an angel of God speaking to Daniel:\r\n\r\n>Daniel 12:2 - And many of them that sleep in the dust of the earth shall awake, some to everlasting life, and some to shame and **everlasting contempt.**\r\n\r\n**Everlasting** is a word that is used fairly often with respect to hell; both in the old and new testament. Can you imagine how terrible a translation would have to be to mess this up? I accept that it is technically possible for the translations we have available to us to be corrupted, but until *that* can be shown, then must we not accept what the text says? lets see what else it says...\r\n\r\n>John 5:28-29 - (28) Marvel not at this: for the hour is coming, in the which all that are in the graves shall hear his voice, (29) and shall come forth; **they that have done good, unto the resurrection of life; and they that have done evil, unto the resurrection of damnation.**\r\n\r\nThe above is documented as having been the words of Jesus himself.\r\n\r\n>Matthew 10:28, 32-33 - (28) And fear not them which kill the body, but are not able to kill the soul: but rather fear him which is able to **destroy both soul and body in hell**. ... (32) Whosoever therefore shall confess me before men, him will I confess also before my Father which is in heaven. (33)  But whosoever shall deny me before men, him will I also deny before my Father which is in heaven. \r\n\r\nSome people use the above passage to justify the idea that hell is not eternal, since the soul is destroyed, and it uses the word destruction elsewhere as well, so this is not an isolated instance.\r\n\r\n>Matthew 13:49-50 -  (49) So shall it be at the end of the world: the angels shall come forth, and sever the wicked from among the just, (50)  **and shall cast them into the furnace of fire**: there shall be wailing and gnashing of teeth. \r\n\r\n>Matthew 25:41,44-46 - (41) Then shall he say also unto them on the left hand, Depart from me, ye cursed, into **everlasting fire**, prepared for the devil and his angels: ... (44) Then shall they also answer him, saying, Lord, when saw we thee an hungred, or athirst, or a stranger, or naked, or sick, or in prison, and did not minister unto thee? (45) Then shall he answer them, saying, Verily I say unto you, Inasmuch as ye did it not to one of the least of these, ye did it not to me. (46) And these shall go away into **everlasting punishment**: but the righteous into life eternal.\r\n\r\n>Mark 9:43-44 - (43) And if thy hand offend thee, cut it off: it is better for thee to enter into life maimed, than having two hands to go into hell, **into the fire that never shall be quenched**: (44) **Where their worm dieth not, and the fire is not quenched.**\r\n\r\n>John 3:18,36 - (18) He that believeth on him is not condemned: but **he that believeth not is condemned already**, because he hath not believed in the name of the only begotten Son of God. ... (36) He that believeth on the Son hath everlasting life: and **he that believeth not the Son shall not see life; but the wrath of God abideth on him**.\r\n\r\nHere the choices are everlasting life, or the wrath of God. Is this substantially more palpable than everlasting life and everlasting torment?\r\n\r\n>2 Thessalonians 1:8-9 - (8)  In flaming fire taking vengeance on them that know not God, and that obey not the gospel of our Lord Jesus Christ: (9)  Who shall be punished with **everlasting destruction from the presence of the Lord, and from the glory of his power;**\r\n\r\nNow, if we imagine earth as a place where both good and evil exists, where evil abounds, but where God still mitigates and protects, and then we shift to considering a world where God plays no part at all, what would that world look like? If the punishment of the wicked ultimately amounts to complete separation from God, what could be worse than that? what could be more torturous? If it is the distance to which we find ourselves separated from God which determines our level of torment, (in both this world and the next) then what would absolute separation result in?\r\n\r\n>Jude 1:7 - Even as Sodom and Gomorrha, and the cities about them in like manner, giving themselves over to fornication, and going after strange flesh, are set forth for an example, suffering the vengeance of **eternal fire.**\r\n\r\n>Revelation 14:11 - **And the smoke of their torment ascendeth up for ever and ever**: and they have no rest day nor night, who worship the beast and his image, and whosoever receiveth the mark of his name. \r\n\r\n>Revelation 20:10,15 - (10) And the devil that deceived them was cast into the lake of fire and brimstone, where the beast and the false prophet are, and **shall be tormented day and night for ever and ever.** (15) And whosoever was not found written in the book of life was cast into the lake of fire. \r\n\r\n>Revelation 21:7-8 - (7)  He that overcometh shall inherit all things; and I will be his God, and he shall be my son. (8)  **But the fearful, and unbelieving, and the abominable, and murderers, and whoremongers, and sorcerers, and idolaters, and all liars, shall have their part in the lake which burneth with fire and brimstone**: which is the second death.\r\n\r\n_________________________________________________________________________________________________________\r\n\r\nSo now my thoughts; one thought is that even though the wicked may all go to the same place, the punishment they receive is still described as being commensurate with their crime:\r\n\r\n>Luke 12:46-48 - (46) The lord of that servant will come in a day when he looketh not for him, and at an hour when he is not aware, and will cut him in sunder, and will appoint him his portion with the unbelievers. (47) And that servant, which knew his lord's will, and prepared not himself, neither did according to his will, shall be beaten with many stripes. (48) But he that knew not, and did commit things worthy of stripes, shall be beaten with few stripes. For unto whomsoever much is given, of him shall be much required: and to whom men have committed much, of him they will ask the more. \r\n\r\n>Matthew 10:14-15 - (14) And whosoever shall not receive you, nor hear your words, when ye depart out of that house or city, shake off the dust of your feet. (15) Verily I say unto you, It shall be more tolerable for the land of Sodom and Gomorrha in the day of judgment, than for that city.\r\n\r\nSo maybe the homeless drunkard will have to endure 100°F, but those who are more Hitler-like will have to endure 125°F, and the anti-christ and Satan will have to endure 150°F. This is likely an over-simplification of the matter, but it is not hard to imagine that God's judgment is fair, and such fairness is indicated in numerous places in scripture.\r\n\r\nAs for the eternal part, I think it is worth considering that there will not be time, and I think this is what is being referenced when eternity is spoken of; and if there is no time, then wouldn't *any* time be *all* time? As in, if there is no time, how can there be a distinction made in the severity of the punishment as it relates to the length of how long one endures such punishment? What would make more sense, is that if the severity was determined not by the length of the punishment, but by the punishment itself. If you are sentenced to life in prison with a beating once per month, it probably wouldn't be such a bad experience overall. If the beating were once per week, it would be much worse, and if the beating were every day, it would be nigh intolerable.\r\n\r\nIn summary, having said all of that, it may be that the bible versions we have available to us are corrupted (there were times in the history of both Israel and the Roman Catholic church wherein access to God's word was restricted to the masses), and thus punishment may not be eternal but rather limited in duration, (after which the soul is destroyed and the individual ceases to experience anything); \r\n\r\n*however*, as the text reads, there's really no way around what is at least the potential for eternal punishment, except that maybe certain sorts of people are destroyed, and other more severe sinners are not destroyed, but rather tormented forever. I have serious reservations about this, but I don't rule anything out, given how limited my understanding is.", "body_html": "<p>Most people don't argue heaven after death, assuming they believe in anything after death, but many are less willing to accept hell, and in particular that it would be eternal, or unending. What follows are passages which I believe are relevant to the subject, and would help illuminate what hell is.</p>\n<p>Given that the most controversial component is whether the punishment be eternal, I am going to add emphasis to certain portions which address that specifically.</p>\n<p>I have not kept back verses, so if you think there are other verses in scripture which say something other than what is being said here, please comment with them. When writing these posts I usually gather from two sources, one being my own notes, and another being <a href=\"https://openbible.info\" rel=\"nofollow noopener\" target=\"_blank\">openbible.info</a>, which I find to be a good crowd sourced compilation of verses pertaining to various doctrines/topics.</p>\n<p>I will give more detail on my personal stance on the matter at the end. <strong>Please, as you read through this, read through the passages in your own bible.</strong> I often leave out verses to keep the post shorter. (I try to use '...' to indicate when I am skipping verses, in addition to the comma separated list at the beginning of each quote). It is also a good opportunity to identify any differences in doctrine between one bible version and another. Everything here is KJV.</p>\n<hr/>\n<p>The matter is concisely summarized here by an angel of God speaking to Daniel:</p>\n<blockquote>\n<p>Daniel 12:2 - And many of them that sleep in the dust of the earth shall awake, some to everlasting life, and some to shame and <strong>everlasting contempt.</strong></p>\n</blockquote>\n<p><strong>Everlasting</strong> is a word that is used fairly often with respect to hell; both in the old and new testament. Can you imagine how terrible a translation would have to be to mess this up? I accept that it is technically possible for the translations we have available to us to be corrupted, but until <em>that</em> can be shown, then must we not accept what the text says? lets see what else it says...</p>\n<blockquote>\n<p>John 5:28-29 - (28) Marvel not at this: for the hour is coming, in the which all that are in the graves shall hear his voice, (29) and shall come forth; <strong>they that have done good, unto the resurrection of life; and they that have done evil, unto the resurrection of damnation.</strong></p>\n</blockquote>\n<p>The above is documented as having been the words of Jesus himself.</p>\n<blockquote>\n<p>Matthew 10:28, 32-33 - (28) And fear not them which kill the body, but are not able to kill the soul: but rather fear him which is able to <strong>destroy both soul and body in hell</strong>. ... (32) Whosoever therefore shall confess me before men, him will I confess also before my Father which is in heaven. (33)  But whosoever shall deny me before men, him will I also deny before my Father which is in heaven.</p>\n</blockquote>\n<p>Some people use the above passage to justify the idea that hell is not eternal, since the soul is destroyed, and it uses the word destruction elsewhere as well, so this is not an isolated instance.</p>\n<blockquote>\n<p>Matthew 13:49-50 -  (49) So shall it be at the end of the world: the angels shall come forth, and sever the wicked from among the just, (50)  <strong>and shall cast them into the furnace of fire</strong>: there shall be wailing and gnashing of teeth.</p>\n</blockquote>\n<blockquote>\n<p>Matthew 25:41,44-46 - (41) Then shall he say also unto them on the left hand, Depart from me, ye cursed, into <strong>everlasting fire</strong>, prepared for the devil and his angels: ... (44) Then shall they also answer him, saying, Lord, when saw we thee an hungred, or athirst, or a stranger, or naked, or sick, or in prison, and did not minister unto thee? (45) Then shall he answer them, saying, Verily I say unto you, Inasmuch as ye did it not to one of the least of these, ye did it not to me. (46) And these shall go away into <strong>everlasting punishment</strong>: but the righteous into life eternal.</p>\n</blockquote>\n<blockquote>\n<p>Mark 9:43-44 - (43) And if thy hand offend thee, cut it off: it is better for thee to enter into life maimed, than having two hands to go into hell, <strong>into the fire that never shall be quenched</strong>: (44) <strong>Where their worm dieth not, and the fire is not quenched.</strong></p>\n</blockquote>\n<blockquote>\n<p>John 3:18,36 - (18) He that believeth on him is not condemned: but <strong>he that believeth not is condemned already</strong>, because he hath not believed in the name of the only begotten Son of God. ... (36) He that believeth on the Son hath everlasting life: and <strong>he that believeth not the Son shall not see life; but the wrath of God abideth on him</strong>.</p>\n</blockquote>\n<p>Here the choices are everlasting life, or the wrath of God. Is this substantially more palpable than everlasting life and everlasting torment?</p>\n<blockquote>\n<p>2 Thessalonians 1:8-9 - (8)  In flaming fire taking vengeance on them that know not God, and that obey not the gospel of our Lord Jesus Christ: (9)  Who shall be punished with <strong>everlasting destruction from the presence of the Lord, and from the glory of his power;</strong></p>\n</blockquote>\n<p>Now, if we imagine earth as a place where both good and evil exists, where evil abounds, but where God still mitigates and protects, and then we shift to considering a world where God plays no part at all, what would that world look like? If the punishment of the wicked ultimately amounts to complete separation from God, what could be worse than that? what could be more torturous? If it is the distance to which we find ourselves separated from God which determines our level of torment, (in both this world and the next) then what would absolute separation result in?</p>\n<blockquote>\n<p>Jude 1:7 - Even as Sodom and Gomorrha, and the cities about them in like manner, giving themselves over to fornication, and going after strange flesh, are set forth for an example, suffering the vengeance of <strong>eternal fire.</strong></p>\n</blockquote>\n<blockquote>\n<p>Revelation 14:11 - <strong>And the smoke of their torment ascendeth up for ever and ever</strong>: and they have no rest day nor night, who worship the beast and his image, and whosoever receiveth the mark of his name.</p>\n</blockquote>\n<blockquote>\n<p>Revelation 20:10,15 - (10) And the devil that deceived them was cast into the lake of fire and brimstone, where the beast and the false prophet are, and <strong>shall be tormented day and night for ever and ever.</strong> (15) And whosoever was not found written in the book of life was cast into the lake of fire.</p>\n</blockquote>\n<blockquote>\n<p>Revelation 21:7-8 - (7)  He that overcometh shall inherit all things; and I will be his God, and he shall be my son. (8)  <strong>But the fearful, and unbelieving, and the abominable, and murderers, and whoremongers, and sorcerers, and idolaters, and all liars, shall have their part in the lake which burneth with fire and brimstone</strong>: which is the second death.</p>\n</blockquote>\n<hr/>\n<p>So now my thoughts; one thought is that even though the wicked may all go to the same place, the punishment they receive is still described as being commensurate with their crime:</p>\n<blockquote>\n<p>Luke 12:46-48 - (46) The lord of that servant will come in a day when he looketh not for him, and at an hour when he is not aware, and will cut him in sunder, and will appoint him his portion with the unbelievers. (47) And that servant, which knew his lord's will, and prepared not himself, neither did according to his will, shall be beaten with many stripes. (48) But he that knew not, and did commit things worthy of stripes, shall be beaten with few stripes. For unto whomsoever much is given, of him shall be much required: and to whom men have committed much, of him they will ask the more.</p>\n</blockquote>\n<blockquote>\n<p>Matthew 10:14-15 - (14) And whosoever shall not receive you, nor hear your words, when ye depart out of that house or city, shake off the dust of your feet. (15) Verily I say unto you, It shall be more tolerable for the land of Sodom and Gomorrha in the day of judgment, than for that city.</p>\n</blockquote>\n<p>So maybe the homeless drunkard will have to endure 100°F, but those who are more Hitler-like will have to endure 125°F, and the anti-christ and Satan will have to endure 150°F. This is likely an over-simplification of the matter, but it is not hard to imagine that God's judgment is fair, and such fairness is indicated in numerous places in scripture.</p>\n<p>As for the eternal part, I think it is worth considering that there will not be time, and I think this is what is being referenced when eternity is spoken of; and if there is no time, then wouldn't <em>any</em> time be <em>all</em> time? As in, if there is no time, how can there be a distinction made in the severity of the punishment as it relates to the length of how long one endures such punishment? What would make more sense, is that if the severity was determined not by the length of the punishment, but by the punishment itself. If you are sentenced to life in prison with a beating once per month, it probably wouldn't be such a bad experience overall. If the beating were once per week, it would be much worse, and if the beating were every day, it would be nigh intolerable.</p>\n<p>In summary, having said all of that, it may be that the bible versions we have available to us are corrupted (there were times in the history of both Israel and the Roman Catholic church wherein access to God's word was restricted to the masses), and thus punishment may not be eternal but rather limited in duration, (after which the soul is destroyed and the individual ceases to experience anything);</p>\n<p><em>however</em>, as the text reads, there's really no way around what is at least the potential for eternal punishment, except that maybe certain sorts of people are destroyed, and other more severe sinners are not destroyed, but rather tormented forever. I have serious reservations about this, but I don't rule anything out, given how limited my understanding is.</p>\n", "comment_count": 1, "created_utc": 1606423585, "domain": "text post", "downvotes": 0, "edited_utc": 0, "fullname": "t2_57t2", "guild_id": "2mo", "guild_name": "JesusChrist", "herald_guild": null, "id": "57t2", "is_archived": true, "is_banned": false, "is_bot": false, "is_crosspost": false, "is_deleted": false, "is_distinguished": false, "is_heralded": false, "is_nsfl": false, "is_nsfw": false, "is_offensive": false, "is_pinned": false, "meta_description": null, "meta_title": null, "original_guild_id": null, "original_guild_name": null, "permalink": "/+JesusChrist/post/57t2/hell-sheol-hades-tartarus", "score": 3, "thumb_url": null, "title": "Hell (Sheol, Hades, Tartarus)", "upvotes": 4, "url": ""}, "post_id": "57t2", "score": 1, "upvotes": 1, "voted": 0}
